{
  "http://mat-service.fi/": {
    "http://mat-service.fi/index.html": "MAT-SERVICE OY MAT-SERVICE OY TUOTTEET KUVAGALLERIA YHTEYSTIEDOT Kuljetinjärjestelmiä kilpailukykyiseen tuotantoon Mat-Service Oy on forssalainen teollisuuden kuljetinjärjestelmiä suunnitteleva ja toimittava yritys. Olemme Erikoistuneet hygieenisten tilojen, kuten elintarvike-, elektroniikka ja paperiteollisuuden kuljetinjärjestelmiin. Palvelumme kattaa kokonaisvaltaisesti suunnittelun, laitetoimitukset, kokoonpanon, asennukset ja huollon tarvikemyynteineen. Tavoitteenamme on tarjota asiakkaille vahvalla ammattitaidolla ja pitkällä kokemuksella hyväksi havaittua huolto- ja asennuspalvelua teollisuuden materiakäsittely- ja pakkausjärjestelmiin. Tulevaisuuden toimija Mat-Service Oy on vuodesta 2000 lähtien toiminut kuljetinjärjestelmiä suunnitteleva ja valmistava yritys. Tuotantotilamme sijaitsevat Forssan Matkussa - hyvien ja lyhyiden yhteyksien päässä Etelä-Suomen kasvukeskuksista. Asiakkaamme ovat noin 150 kilometrin säteellä meistä, mikä takaa nopean huoltovasteajan. Palveluksessamme työskentelee kolme henkilöä. Olemme kasvaneet nopeasti ja Mat-Servicestä on tullut merkittävä kuljetinjärjestelmien toimittaja kotimaan teollisuudelle. Tavoitteenamme on kasvaa edelleen - olemme juuri laajentaneet merkittävästi tuotantotilojamme 240 neliöstä 940 neliömetriin. © MAT-SERVICE OY 2016",
    "http://mat-service.fi/yhteystiedot.html": "MAT-SERVICE OY MAT-SERVICE OY TUOTTEET KUVAGALLERIA YHTEYSTIEDOT MAT-SERVICE OY Jouni Mattila Menostentie 190 31110 Matku Puh/Fax: (03) 435 1416 GSM: 040 760 0255 Email: jouni.mattila[@]mat-service.fi © MAT-SERVICE OY 2016",
    "http://mat-service.fi/tuotteet.html": "MAT-SERVICE OY MAT-SERVICE OY TUOTTEET KUVAGALLERIA YHTEYSTIEDOT Kuljetinjärjestelmät: Olemme toimittaneet kuljetinjärjestelmiä jo 46 suomalaiseen tehtaaseen. Pystymme tarjoamaan markkinoiden toimintavarmimpia kuljetinjärjestelmiä, jotka perustuvat Flexlink-tuotteisiin. Tuotteemme ovat: Toimintavarmoja. Kun prosessi toimii häiriöttä ja varmasti, ei tuotantoon tule turhia ja kalliita keskeytyksiä. Tuotteet ovat myös huoltovapaita. Taloudellisia. Hyvin hiottu kuljetinprosessi tuo yritykselle säästöjä. Hygieenisiä. Tuotteet täyttävät elintarviketuotantoa koskevat hygieniavaatimukset. Valmistamme lamellikuljetinjärjestelmiä 65mm leveydestä aina 1200mm leveyteen asti. Rakenteet valmistamme ruostumattomasta teräksestä. Laminaarit, työtasot yms. alumiinista. Olemme Flexlink-kuljetinjärjestelmien maahantuoja. © MAT-SERVICE OY 2016",
    "http://mat-service.fi/galleria.html": "MAT-SERVICE OY MAT-SERVICE OY TUOTTEET KUVAGALLERIA YHTEYSTIEDOT © MAT-SERVICE OY 2016"
  },
  "https://www.octomeca.fi/": {
    "https://www.octomeca.fi/contact-request/": "Contact request - Octomeca.fi This website uses cookies to ensure you get the best experience on our website. Read more Accept This website uses cookies to ensure you get the best experience on our website. Read more Octomeca Oy +358 (0)2431 4409 sales@octomeca.fi Youtube Premium Class Load Protection Solutions Menu Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Home Contact request Contact request Fields marked with an * are required First Name * Last Name * Company E-mail * Address Post Number City Telephone Message * If you are a human seeing this field, please leave it empty. ENG Kukolantie 3, FI-21100 Naantali Call center: +358 2 431 44 09 E-mail: sales@octomeca.fi Personal e-mails: firstname.lastname@octomeca.fi Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Youtube © Copyright 2019Octomeca.fi. Search engine optimized webpages and web presence management Planeetta Internet Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Youtube",
    "https://www.octomeca.fi/company/octomeca-oy/": "Octomeca Oy - Octomeca.fi This website uses cookies to ensure you get the best experience on our website. Read more Accept This website uses cookies to ensure you get the best experience on our website. Read more Octomeca Oy +358 (0)2431 4409 sales@octomeca.fi Youtube Premium Class Load Protection Solutions Menu Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Company Octomeca Oy FROMM Group Home Company Octomeca Oy Company Octomeca is finnish technology company founded year 1989. We are specialized in designing and manufacturing of premium class stretch film wrapping machines. The company is located in Naantali, south-western part of Finland. Today, most of the machines are delivered to customers all around the world. Standard machines with modular construction as well as tailor-made special innovations in load protection are guiding us forward. Both horizontal and vertical wrapping solutions help us to solve various packaging challenges. With almost 30 years of experience, Octomeca has delivered over 1 000 wrapping machines and packaging lines all around the world. Since 2017 Octomeca has been a part of international FROMM-Group, specialized in packaging machines and materials. In addition to wrapping machines, we also provide “Lifecycle Case” service, spare parts and modernizations to our machines. We wish to take excellent care of our customers and are committed to guarantee long-lasting, lifetime operation to our solutions. ENG Kukolantie 3, FI-21100 Naantali Call center: +358 2 431 44 09 E-mail: sales@octomeca.fi Personal e-mails: firstname.lastname@octomeca.fi Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Youtube © Copyright 2019Octomeca.fi. Search engine optimized webpages and web presence management Planeetta Internet Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Youtube",
    "https://www.octomeca.fi/products/omc-h-series/": "OMC-H Series - Octomeca.fi This website uses cookies to ensure you get the best experience on our website. Read more Accept This website uses cookies to ensure you get the best experience on our website. Read more Octomeca Oy +358 (0)2431 4409 sales@octomeca.fi Youtube Premium Class Load Protection Solutions Menu Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Home Products OMC Series OMC-H Series OMC-H Series OMC-H Series Most robust, most reliable fully automatic wrapping machine for industrial use. We provide solutions up to 150pph. OMC-H rotation arm machine is wrapping various loads (with or without pallet) horizontally with stretch film. Machines size is defined according to maximum load diagonal measurement. In addition to predefined modular sizes, even tailormade sizes can be made. We do build biggest fully automatic wrapping machines in the market. Modern technology and film Power-Pre-Stretch device enables to achieve an economic, sturdy transport packaging. As option, the machines can be equipped with various options. Main options to meet requirements on different segments: -Integrated top sheet (dust or splash proof) -Automatic roll change applicator (1+3 or 1+9 rolls) -Corner post applicator with various corner post magazine types -2 Motor Power-pre-Stretch carriage (stepless pre-stretching adjustement) -Double arm construction to reach up to 150pph -Power-pre-Stretch carriage for 750mm wide film Watch videos on youtube OMC-H2100 CPA_RCA4_TSC_V20 ENG Kukolantie 3, FI-21100 Naantali Call center: +358 2 431 44 09 E-mail: sales@octomeca.fi Personal e-mails: firstname.lastname@octomeca.fi Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Youtube © Copyright 2019Octomeca.fi. Search engine optimized webpages and web presence management Planeetta Internet Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Youtube",
    "https://www.octomeca.fi/various-ways-to-protect-your-products-with-stretch-film/": "Various ways to protect your products with stretch film - Octomeca.fi This website uses cookies to ensure you get the best experience on our website. Read more Accept This website uses cookies to ensure you get the best experience on our website. Read more Octomeca Oy +358 (0)2431 4409 sales@octomeca.fi Youtube Premium Class Load Protection Solutions Menu Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Home Various ways to protect your products with stretch film Various ways to protect your products with stretch film How can we protect your product loads? There are many ways to support and protect product loads during transport and warehousing. Due to our long experience of wrapping machine engineering we can solve even the most demanding customer needs. By combining various innovations and stretch film technology, the products can even be protected from all sides for demanding transport conditions. Individual stretch film bands support the load and are a cost effective and gentle way to improve the final packaging quality. Corner posts protect product/load corners and support stacked pallets loads when placed on top of each other. Well placed Top Sheet with horizontal wrapping is giving excellent protection against dust, splash-water and dirt. Logo Curtain System is giving an excellent outlook for your product loads while delivered from the factory. And so on…we have many various ways to protect especially your loads! ENG Kukolantie 3, FI-21100 Naantali Call center: +358 2 431 44 09 E-mail: sales@octomeca.fi Personal e-mails: firstname.lastname@octomeca.fi Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Youtube © Copyright 2019Octomeca.fi. Search engine optimized webpages and web presence management Planeetta Internet Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Youtube",
    "https://www.octomeca.fi/company/": "Company - Octomeca.fi This website uses cookies to ensure you get the best experience on our website. Read more Accept This website uses cookies to ensure you get the best experience on our website. Read more Octomeca Oy +358 (0)2431 4409 sales@octomeca.fi Youtube Premium Class Load Protection Solutions Menu Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Company Octomeca Oy FROMM Group Home Company Company ENG Kukolantie 3, FI-21100 Naantali Call center: +358 2 431 44 09 E-mail: sales@octomeca.fi Personal e-mails: firstname.lastname@octomeca.fi Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Youtube © Copyright 2019Octomeca.fi. Search engine optimized webpages and web presence management Planeetta Internet Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Youtube",
    "https://www.octomeca.fi/lifecycle-care/total-cost-of-ownership-tco/": "Total Cost of Ownership (TCO) - Octomeca.fi This website uses cookies to ensure you get the best experience on our website. Read more Accept This website uses cookies to ensure you get the best experience on our website. Read more Octomeca Oy +358 (0)2431 4409 sales@octomeca.fi Youtube Premium Class Load Protection Solutions Menu Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Lifecycle care Lifecycle care Service and Spare Parts Home Lifecycle care Total Cost of Ownership (TCO) Total Cost of Ownership (TCO) TCO thinking is used to estimate the total cost of an investment over its entire life cycle. Top of investments purchase price, the total costs must take into account during the whole lifecycle. Most relevant factor in TCO is equipment reliability. Unplanned production stops and low packaging quality are essential elements when evaluating TCO. Professional machine installation, commissioning, spare parts, maintenance and technical developments during the life cycle are important factors to ensure excellent TCO. Expected life cycle for Octomeca’s equipment’s is long, even +20 years. This is possible by means of high technical quality of the machines and cost effective lifecycle services provided by Octomeca. Please contact to: service@octomeca.fi Lifecycle services Octomeca offers versatile and professional lifecycle services for all Octomeca equipment’s from installation and start to additional machine options and modernizations. It is possible to update the machine with the latest technical innovations at any stage of the life cycle when needed. Proactive maintenance and reliable spare part services are the most important life cycle services which affect the machines life cycle length, TCO and machines equable usability. Octomeca offers tailored and flexible preventive maintenance plans based on customers production and machine needs.   Top of that Octomeca’s professional service team is ready to serve technical support requests with quick response. Please contact to: service@octomeca.fi Preventive maintenance agreements General service visits Additional machine options Machine modernizations Installations and start up’s Operator trainings ENG Kukolantie 3, FI-21100 Naantali Call center: +358 2 431 44 09 E-mail: sales@octomeca.fi Personal e-mails: firstname.lastname@octomeca.fi Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Youtube © Copyright 2019Octomeca.fi. Search engine optimized webpages and web presence management Planeetta Internet Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Youtube",
    "https://www.octomeca.fi/products/omc-v-series/": "OMC-V Series - Octomeca.fi This website uses cookies to ensure you get the best experience on our website. Read more Accept This website uses cookies to ensure you get the best experience on our website. Read more Octomeca Oy +358 (0)2431 4409 sales@octomeca.fi Youtube Premium Class Load Protection Solutions Menu Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Home Products OMC Series OMC-V Series OMC-V Series Show more images OMC-V Series With OMC-V series wrapping machines, the product is driven through vertically rotating ring. The products are wrapped spirally, or only making film bands. Also bottom beams can be fixed with specific elastic bands. Machine size is defined according to product maximum cross diagonal measurement. We are engineering and manufacturing biggest Vertical ring wrappers in the world. We are supplying our solutions to various segments. Main options to meet requirements in different segments are: -Integrated top sheet or product end closing equipment -Automatic roll changer 1+3 rolls -Power-Pre-Stretch carriage -Ring height adjustement kit for big load size compensation -Load support rollers on top/side -Wrapzone conveyors for various loads In case of very big items (like EPS blocks), we are able to provide innovative OMC-VO machine. Instead of traditional ring, the rectangular shaped track of the machine is made according to product dimensions. Watch videos on youtube OMC-V2000TS Layout ENG Kukolantie 3, FI-21100 Naantali Call center: +358 2 431 44 09 E-mail: sales@octomeca.fi Personal e-mails: firstname.lastname@octomeca.fi Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Youtube © Copyright 2019Octomeca.fi. Search engine optimized webpages and web presence management Planeetta Internet Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Youtube",
    "https://www.octomeca.fi/fi/": "Etusivu - Octomeca Sivustomme käyttää evästeitä käyttökokemuksen parantamiseksi. Käyttämällä sivustoa hyväksyt evästeiden käytön. Lue lisää Hyväksy Sivustomme käyttää evästeitä käyttökokemuksen parantamiseksi. Käyttämällä sivustoa hyväksyt evästeiden käytön. Lue lisää Octomeca Oy +358 (0)2431 4409 sales@octomeca.fi Youtube Premium Class Load Protection Solutions Valikko Etusivu Yritys Octomeca Oy FROMM Group Tuotteet OMC-H -mallisto OMC-V -mallisto OMC-R -mallisto OMC-CW -mallisto Elinkaaripalvelut Elinkaaripalvelut Huolto ja varaosat Yhteydenotto Huoltotilaus Yhteystiedot OMC-V -mallisto OMC-V -käärintäkoneilla pakattava tuote ajetaan pystysuuntaisen käärintäkehän läpi. Pakattavan tuotteen mittojen mukaisesti päätetään koneen kehäkoko. Lue lisää OMC-R -mallisto OMC-R -rullankäärintäkoneilla voidaan kääriä mm. paperi, teräs, alumiini tai komposiittirullat joko aksiaalisesti tai radiaalisesti. Lue lisää OMC CW -mallisto OMC-CW -verhokoneet on tarkoitettu säännöllisen muotoisten tuotteiden suojaamiseen (kuten esim. saha- ja metsäteollisuus) kuljetuksen ajaksi. Lue lisää Premium class load protection from the north Octomeca Finland since 1989 Lue lisää OMC-H -mallisto OMC -H -käärintäkoneet on suunniteltu pitkäaikaiseen, teolliseen käyttöön. Malliston ominaispiirteitä ovat vahva teräksinen runkorakenne, koetellut toiminnot ja korkealuokkaiset komponentit. Lue lisää OMC-V -mallisto OMC-V -käärintäkoneilla pakattava tuote ajetaan pystysuuntaisen käärintäkehän läpi. Pakattavan tuotteen mittojen mukaisesti päätetään koneen kehäkoko. Lue lisää OMC-R -mallisto OMC-R -rullankäärintäkoneilla voidaan kääriä mm. paperi, teräs, alumiini tai komposiittirullat joko aksiaalisesti tai radiaalisesti. Lue lisää OMC CW -mallisto OMC-CW -verhokoneet on tarkoitettu säännöllisen muotoisten tuotteiden suojaamiseen (kuten esim. saha- ja metsäteollisuus) kuljetuksen ajaksi. Lue lisää Premium class load protection from the north Octomeca Finland since 1989 Lue lisää OMC-H -mallisto OMC -H -käärintäkoneet on suunniteltu pitkäaikaiseen, teolliseen käyttöön. Malliston ominaispiirteitä ovat vahva teräksinen runkorakenne, koetellut toiminnot ja korkealuokkaiset komponentit. Lue lisää OMC-V -mallisto OMC-V -käärintäkoneilla pakattava tuote ajetaan pystysuuntaisen käärintäkehän läpi. Pakattavan tuotteen mittojen mukaisesti päätetään koneen kehäkoko. Lue lisää Octomeca OMC-H -mallisto OMC-V -mallisto OMC-R -mallisto OMC CW -mallisto Octomecan kiristekäärintäkoneilla varmistetaan tuotteidenne laadukas kuljetuspakkaus. Octomecan käärintäkonemallistosta on valittavissa kustannustehokas ratkaisu lavapakkaustarpeisiinne. Yhdistämällä käärintäteknologiaa, kiristekalvoa ja erilaisia lisätoimintoja, asiakas saa kompaktin ja luotettavan pakkauslaitteiston ”avaimet käteen” toimituksella. Ratkaisemme innovatiivisuutta vaativat lavankäärintähaasteet. Asiakkaan ei tarvitse tarjousta pyytäessään tietää eri konetyyppien ominaisuuksia, vaan lähtökohtana on toivottu pakkausratkaisu. Octomeca huolehtii teknisestä toteutuksesta halutun pakkausratkaisun saavuttamiseksi. Koneet rakennetaan vuosikymmenien kokemuksella ja käyttämällä sekä nykyaikaista tuotantotekniikkaa että huippuluokan komponentteja. Koneet on suunniteltu pitkäaikaiseen ja vaativaan käyttöön. Asiakkaitamme ovat alansa johtavat yritykset kuin myös pienemmät paikalliset yritykset, joille on yhteistä laitteiden ja palveluiden korkea vaatimustaso. Käärintätavat ja tuotesuojaus Lue lisää Kiristekalvo, 100% kierrätettävä pakkausmateriaali Lue lisää Total Cost of Ownership (TCO), huolto ja varaosat Lue lisää FI Kukolantie 3, 21100 Naantali Vaihde: +358 2 431 44 09 Sähköposti: sales@octomeca.fi Henkilökohtaiset sähköpostiosoitteet: etunimi.sukunimi@octomeca.fi Etusivu Yritys Octomeca Oy FROMM Group Tuotteet OMC-H -mallisto OMC-V -mallisto OMC-R -mallisto OMC-CW -mallisto Elinkaaripalvelut Elinkaaripalvelut Huolto ja varaosat Yhteydenotto Huoltotilaus Yhteystiedot Youtube © Copyright 2019Octomeca. Hakukoneoptimoidut kotisivut ja verkkoläsnäolo Planeetta Internet Etusivu Yritys Octomeca Oy FROMM Group Tuotteet OMC-H -mallisto OMC-V -mallisto OMC-R -mallisto OMC-CW -mallisto Elinkaaripalvelut Elinkaaripalvelut Huolto ja varaosat Yhteydenotto Huoltotilaus Yhteystiedot Youtube",
    "https://www.octomeca.fi/service-request/": "Service request - Octomeca.fi This website uses cookies to ensure you get the best experience on our website. Read more Accept This website uses cookies to ensure you get the best experience on our website. Read more Octomeca Oy +358 (0)2431 4409 sales@octomeca.fi Youtube Premium Class Load Protection Solutions Menu Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Home Service request Service request Fields marked with an * are required First Name * Last Name * E-mail * Telephone * Company * Customer Number (if known) Address * Post Number * City * Machine type (if known) Description of needed service * If you are a human seeing this field, please leave it empty. ENG Kukolantie 3, FI-21100 Naantali Call center: +358 2 431 44 09 E-mail: sales@octomeca.fi Personal e-mails: firstname.lastname@octomeca.fi Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Youtube © Copyright 2019Octomeca.fi. Search engine optimized webpages and web presence management Planeetta Internet Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Youtube",
    "https://www.octomeca.fi/stretch-film-100-recyclable-packaging-material/": "Stretch film, 100 % recyclable packaging material - Octomeca.fi This website uses cookies to ensure you get the best experience on our website. Read more Accept This website uses cookies to ensure you get the best experience on our website. Read more Octomeca Oy +358 (0)2431 4409 sales@octomeca.fi Youtube Premium Class Load Protection Solutions Menu Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Home Stretch film, 100 % recyclable packaging material Stretch film, 100 % recyclable packaging material Stretch film is made of LLDP (Linear Low-Density Polyethylene) which is one of the most used packaging materials around the world. Due to wide selection of various film qualities and thicknesses, it can be used as protective packaging material to many products or palletized loads. Recently, there has been a lot of discussion about environmental challenges and recycling of the packaging materials. Even so this topic is still a big question, solutions or alternatives in order to improve the material recycling can already be found. Altogether, it’s more or less up to society’s activities to organize recycling and people’s attitudes. Recent development in machine techniques makes it possible to take advantage of the modern stretch films. The pre-stretch device gives a better film force on to the load, but it usually also means better packaging economy. Thinner film quality can be used or even fewer wrapping rounds pro pallet. Stretch film is made of 100 % polyethylene, a fully recyclable material. In order to be able to have the optimal end-result for each customer, it is now possible to combine specific load protection with full recycling. ENG Kukolantie 3, FI-21100 Naantali Call center: +358 2 431 44 09 E-mail: sales@octomeca.fi Personal e-mails: firstname.lastname@octomeca.fi Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Youtube © Copyright 2019Octomeca.fi. Search engine optimized webpages and web presence management Planeetta Internet Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Youtube",
    "https://www.octomeca.fi": "Home - Octomeca.fi This website uses cookies to ensure you get the best experience on our website. Read more Accept This website uses cookies to ensure you get the best experience on our website. Read more Octomeca Oy +358 (0)2431 4409 sales@octomeca.fi Youtube Premium Class Load Protection Solutions Menu Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact OMC-V Series With OMC-V series wrapping machines, the product is driven through vertically rotating ring. The products are wrapped spirally, or only making film bands with bottom beams. Machine size is defined according to product maximum cross diagonal measurement. Read more OMC-R Series OMC-R reel wrapping machines can wrap various reels of paper, steel, aluminum or composite. The machine can be equipped with rotary arm for axial wrapping or with linearly moving head for radial wrapping. Read more OMC CW Series OMC-CW (Curtain Wall) machines can be used if the products are rectangular and need special protection. The final package is formed by placing the top sheet between two side film layers. The side films are stretched with tension rollers and at the end of the process heat-sealed together. Read more Premium class load protection from the north Octomeca Finland since 1989 Read more OMC-H Series OMC-H rotary arm machine wraps various loads (with or without pallet) horizontally with stretch film.  Machines size is defined according to maximum load diagonal measurement. In addition to standard machine sizes, even big models can be made. Read more OMC-V Series With OMC-V series wrapping machines, the product is driven through vertically rotating ring. The products are wrapped spirally, or only making film bands with bottom beams. Machine size is defined according to product maximum cross diagonal measurement. Read more OMC-R Series OMC-R reel wrapping machines can wrap various reels of paper, steel, aluminum or composite. The machine can be equipped with rotary arm for axial wrapping or with linearly moving head for radial wrapping. Read more OMC CW Series OMC-CW (Curtain Wall) machines can be used if the products are rectangular and need special protection. The final package is formed by placing the top sheet between two side film layers. The side films are stretched with tension rollers and at the end of the process heat-sealed together. Read more Premium class load protection from the north Octomeca Finland since 1989 Read more OMC-H Series OMC-H rotary arm machine wraps various loads (with or without pallet) horizontally with stretch film.  Machines size is defined according to maximum load diagonal measurement. In addition to standard machine sizes, even big models can be made. Read more OMC-V Series With OMC-V series wrapping machines, the product is driven through vertically rotating ring. The products are wrapped spirally, or only making film bands with bottom beams. Machine size is defined according to product maximum cross diagonal measurement. Read more Octomeca OMC-H Series OMC-V Series OMC-R Series OMC CW Series Load protection for transportation and warehousing with Octomeca wrapping solutions. Cost-effective and strong transportation package is achieved by using stretch film wrapping machines. We solve even difficult and demanding wrapping challenges. By combining stretch film and additional machine functions, customer receives a compact and reliable packaging solution as turn-key delivery. If needed, we can even develop a completely new concept according to customer needs. When asking for a quotation, customer does not need to know all different machine details. Instead, the required final package solution is our project starting point. Machines are built by using modern technology and high-class components. Technical solutions represent the highest quality and are built for heavy industrial use with minimum service needed. Machines are delivered including installation and start-up. Our customers are the leading companies in different segments worldwide as well as smaller local companies. They all have high quality demands for their production machines and after-sales services. Various ways to protect your products with stretch film Read more Stretch film, 100 % recyclable packaging material Read more Total Cost of Ownership (TCO), Service and Spare Parts Read more ENG Kukolantie 3, FI-21100 Naantali Call center: +358 2 431 44 09 E-mail: sales@octomeca.fi Personal e-mails: firstname.lastname@octomeca.fi Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Youtube © Copyright 2019Octomeca.fi. Search engine optimized webpages and web presence management Planeetta Internet Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Youtube",
    "https://www.octomeca.fi/": "Home - Octomeca.fi This website uses cookies to ensure you get the best experience on our website. Read more Accept This website uses cookies to ensure you get the best experience on our website. Read more Octomeca Oy +358 (0)2431 4409 sales@octomeca.fi Youtube Premium Class Load Protection Solutions Menu Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact OMC-V Series With OMC-V series wrapping machines, the product is driven through vertically rotating ring. The products are wrapped spirally, or only making film bands with bottom beams. Machine size is defined according to product maximum cross diagonal measurement. Read more OMC-R Series OMC-R reel wrapping machines can wrap various reels of paper, steel, aluminum or composite. The machine can be equipped with rotary arm for axial wrapping or with linearly moving head for radial wrapping. Read more OMC CW Series OMC-CW (Curtain Wall) machines can be used if the products are rectangular and need special protection. The final package is formed by placing the top sheet between two side film layers. The side films are stretched with tension rollers and at the end of the process heat-sealed together. Read more Premium class load protection from the north Octomeca Finland since 1989 Read more OMC-H Series OMC-H rotary arm machine wraps various loads (with or without pallet) horizontally with stretch film.  Machines size is defined according to maximum load diagonal measurement. In addition to standard machine sizes, even big models can be made. Read more OMC-V Series With OMC-V series wrapping machines, the product is driven through vertically rotating ring. The products are wrapped spirally, or only making film bands with bottom beams. Machine size is defined according to product maximum cross diagonal measurement. Read more OMC-R Series OMC-R reel wrapping machines can wrap various reels of paper, steel, aluminum or composite. The machine can be equipped with rotary arm for axial wrapping or with linearly moving head for radial wrapping. Read more OMC CW Series OMC-CW (Curtain Wall) machines can be used if the products are rectangular and need special protection. The final package is formed by placing the top sheet between two side film layers. The side films are stretched with tension rollers and at the end of the process heat-sealed together. Read more Premium class load protection from the north Octomeca Finland since 1989 Read more OMC-H Series OMC-H rotary arm machine wraps various loads (with or without pallet) horizontally with stretch film.  Machines size is defined according to maximum load diagonal measurement. In addition to standard machine sizes, even big models can be made. Read more OMC-V Series With OMC-V series wrapping machines, the product is driven through vertically rotating ring. The products are wrapped spirally, or only making film bands with bottom beams. Machine size is defined according to product maximum cross diagonal measurement. Read more Octomeca OMC-H Series OMC-V Series OMC-R Series OMC CW Series Load protection for transportation and warehousing with Octomeca wrapping solutions. Cost-effective and strong transportation package is achieved by using stretch film wrapping machines. We solve even difficult and demanding wrapping challenges. By combining stretch film and additional machine functions, customer receives a compact and reliable packaging solution as turn-key delivery. If needed, we can even develop a completely new concept according to customer needs. When asking for a quotation, customer does not need to know all different machine details. Instead, the required final package solution is our project starting point. Machines are built by using modern technology and high-class components. Technical solutions represent the highest quality and are built for heavy industrial use with minimum service needed. Machines are delivered including installation and start-up. Our customers are the leading companies in different segments worldwide as well as smaller local companies. They all have high quality demands for their production machines and after-sales services. Various ways to protect your products with stretch film Read more Stretch film, 100 % recyclable packaging material Read more Total Cost of Ownership (TCO), Service and Spare Parts Read more ENG Kukolantie 3, FI-21100 Naantali Call center: +358 2 431 44 09 E-mail: sales@octomeca.fi Personal e-mails: firstname.lastname@octomeca.fi Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Youtube © Copyright 2019Octomeca.fi. Search engine optimized webpages and web presence management Planeetta Internet Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Youtube",
    "https://www.octomeca.fi/products/omc-cw-series/": "OMC-CW Series - Octomeca.fi This website uses cookies to ensure you get the best experience on our website. Read more Accept This website uses cookies to ensure you get the best experience on our website. Read more Octomeca Oy +358 (0)2431 4409 sales@octomeca.fi Youtube Premium Class Load Protection Solutions Menu Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Home Products OMC Series OMC-CW Series OMC-CW Series Show more images OMC-CW Series OMC-CW (Curtain Wall) machines can be used if the products are rectangular and needs weather proof protection with high marketing outlook. The final package is formed by placing the top sheet between two side film layers. The side films are stretched with tension rollers and at the end of the process heat-sealed together. The end-result is strong, splash-water-proof packaging which can also be equipped with printed company logo. Watch videos on youtube OMC-CW1200 with strapper 2 ENG Kukolantie 3, FI-21100 Naantali Call center: +358 2 431 44 09 E-mail: sales@octomeca.fi Personal e-mails: firstname.lastname@octomeca.fi Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Youtube © Copyright 2019Octomeca.fi. Search engine optimized webpages and web presence management Planeetta Internet Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Youtube",
    "https://www.octomeca.fi/company/fromm-group/": "FROMM Group - Octomeca.fi This website uses cookies to ensure you get the best experience on our website. Read more Accept This website uses cookies to ensure you get the best experience on our website. Read more Octomeca Oy +358 (0)2431 4409 sales@octomeca.fi Youtube Premium Class Load Protection Solutions Menu Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Company Octomeca Oy FROMM Group Home Company FROMM Group Securing products around the world The FROMM Group designs, develops and produces a wide variety of systems for unitizing and palletizing goods for transport: strapping machines and systems, pallet stretch wrapping machines, the patented Airpad pillow system, together with all necessary consumables. On a successful track Established in 1947, the Swiss family business generates a turnover in excess of 180 million Euros and employs a workforce of 900 people worldwide. More than 40 subsidiaries in Europe, North and South America, South Africa, Asia and Australia, along with a multitude of specialized sales partners throughout the world ensure – in your vicinity – professional advice, prompt customer service and maintenance. The company pursues a policy of logical vertical integration while upholding traditional values, which are the reasons for decades of success. Development center In the FROMM development center, a long established and experienced team of engineers constantly develops new techniques and products using the very latest 3D CAD systems. Up-to-date test procedures guarantee the high FROMM quality standards. Production centers for machines and equipment Production takes place round the clock in the FROMM production centres. Highly qualified teams of specialists manufacture FROMM products satisfying the highest demands of quality on computer-controlled machines. All machines are tested before leaving the factory. The company has ISO 9001 certification. Production centers for polyester plastic strapping and multilayer blown films STARstrap™ plastic strappings are produced in the FROMM production centres exlusively from recycled polyester bottle material on modern state-of-the-art extrusion plant. These bands guarantee the high quality of the strapping carried out with FROMM machines and equipment. All kinds of film types for the Airpad pillow material are produced on blown film extrusion machines. Special film types guarantee a high loading capacity of the individual pillow elements. The plants are certified in accordance with ISO 9001 and ISO 14000. PET Recycling Produced in the FROMM recycling plant from used PET bottles is high grade ground material, agglomerates and regranulates for the production of PET strapping, foodstuff films, textiles and drink bottles. This enables FROMM PET products to satisfy the most rigorous ecological requirements. The plant is certified in accordance with ISO 9001 and ISO 14001. Link to international FROMM Group pages ENG Kukolantie 3, FI-21100 Naantali Call center: +358 2 431 44 09 E-mail: sales@octomeca.fi Personal e-mails: firstname.lastname@octomeca.fi Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Youtube © Copyright 2019Octomeca.fi. Search engine optimized webpages and web presence management Planeetta Internet Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Youtube",
    "https://www.octomeca.fi/lifecycle-care/service-and-spare-parts/": "Service and Spare Parts - Octomeca.fi This website uses cookies to ensure you get the best experience on our website. Read more Accept This website uses cookies to ensure you get the best experience on our website. Read more Octomeca Oy +358 (0)2431 4409 sales@octomeca.fi Youtube Premium Class Load Protection Solutions Menu Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Lifecycle care Lifecycle care Service and Spare Parts Home Lifecycle care Service and Spare Parts Service and Spare Parts Production machines and devices need to work reliable, effectively and on high performance level. Therefore, they need to have scheduled service. Octomeca’s After Sales Department can offer professional service and spare parts to all our machines. If needed, we can also offer a complete machine installation, start-up and training as turn-key delivery. Even the machines are thoroughly tested before delivery, connections to surrounding devices requires professional skills. When properly executed, the machine is ready for customer’s use for years to come. Life cycle services Octomeca offers versatile and professional lifecycle services for all Octomeca equipment’s from installation and start to additional machine options and modernizations. It is possible to update the machine with the latest technical innovations at any stage of the life cycle when needed. Preventive maintenance and reliable spare part services are the most important life cycle services which affect the machines life cycle length, TCO and machines equable usability. Octomeca offers tailored and flexible preventive maintenance plans based on customers production and machine needs.   Top of that Octomeca’s professional service team is ready to serve technical support requests with quick response. Preventive maintenance agreements General service visits Additional machine options Machine modernizations Installations and start up’s Operator trainings Please contact to: service@octomeca.fi ENG Kukolantie 3, FI-21100 Naantali Call center: +358 2 431 44 09 E-mail: sales@octomeca.fi Personal e-mails: firstname.lastname@octomeca.fi Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Youtube © Copyright 2019Octomeca.fi. Search engine optimized webpages and web presence management Planeetta Internet Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Youtube",
    "https://www.octomeca.fi/lifecycle-care/": "Lifecycle care - Octomeca.fi This website uses cookies to ensure you get the best experience on our website. Read more Accept This website uses cookies to ensure you get the best experience on our website. Read more Octomeca Oy +358 (0)2431 4409 sales@octomeca.fi Youtube Premium Class Load Protection Solutions Menu Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Lifecycle care Lifecycle care Service and Spare Parts Home Lifecycle care Lifecycle care ENG Kukolantie 3, FI-21100 Naantali Call center: +358 2 431 44 09 E-mail: sales@octomeca.fi Personal e-mails: firstname.lastname@octomeca.fi Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Youtube © Copyright 2019Octomeca.fi. Search engine optimized webpages and web presence management Planeetta Internet Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Youtube",
    "https://www.octomeca.fi/cookies": "Cookies - Octomeca.fi This website uses cookies to ensure you get the best experience on our website. Read more Accept This website uses cookies to ensure you get the best experience on our website. Read more Octomeca Oy +358 (0)2431 4409 sales@octomeca.fi Youtube Premium Class Load Protection Solutions Menu Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Home Cookies What are cookies? A cookie is a small piece of text sent to your browser by a website you visit. Cookies enhance the user experience, for example it helps the website to remember information about your visit, like your preferred language and other settings. Without cookies, using the web would be a much more frustrating experience. Why is this website using cookies? Information of logged in user is kept in a cookie. Without this cookie, user would need to input credentials on every page view when browsing pages where authorization is required. Website will forget user login after website session is expired. When you confirm notification about cookies, that’s also saved to a cookie. Without this cookie, same notification would be visible in every page load. We are collecting information of browsing users, using Google Analytics -service. ENG Kukolantie 3, FI-21100 Naantali Call center: +358 2 431 44 09 E-mail: sales@octomeca.fi Personal e-mails: firstname.lastname@octomeca.fi Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Youtube © Copyright 2019Octomeca.fi. Search engine optimized webpages and web presence management Planeetta Internet Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Youtube",
    "https://www.octomeca.fi/product-category/omc-series/": "OMC Series - Octomeca.fi This website uses cookies to ensure you get the best experience on our website. Read more Accept This website uses cookies to ensure you get the best experience on our website. Read more Octomeca Oy +358 (0)2431 4409 sales@octomeca.fi Youtube Premium Class Load Protection Solutions Menu Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Home Products OMC Series OMC Series OMC-H Series OMC-R Series OMC-CW Series OMC-V Series ENG Kukolantie 3, FI-21100 Naantali Call center: +358 2 431 44 09 E-mail: sales@octomeca.fi Personal e-mails: firstname.lastname@octomeca.fi Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Youtube © Copyright 2019Octomeca.fi. Search engine optimized webpages and web presence management Planeetta Internet Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Youtube",
    "https://www.octomeca.fi/contact/": "Contact - Octomeca.fi This website uses cookies to ensure you get the best experience on our website. Read more Accept This website uses cookies to ensure you get the best experience on our website. Read more Octomeca Oy +358 (0)2431 4409 sales@octomeca.fi Youtube Premium Class Load Protection Solutions Menu Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Home Contact Contact Kukolantie 3, FI-21100 Naantali, Finland Tel.: +358 2 431 44 09 sales@octomeca.fi Personal emails: firstname.lastname@octomeca.fi Sales Janne Koskela, managing director +358 (0)45 6609 600 janne.koskela@octomeca.fi email: sales@octomeca.fi Projects Ismo Herava, project manager +358 (0)45 6576 916 ismo.herava@octomeca.fi Mikko Korhonen, project engineer +358 (0)50 598 2557 mikko.korhonen@octomeca.fi Aftersales and spare parts Esa Hiedo, service manager +358 (0)50 401 9910 esa.hiedo@octomeca.fi Service requests and spare parts: service@octomeca.fi Production and purchasing Lauri Halminen, Production, team leader lauri.halminen@octomeca.fi Kari Virtanen, Logistics, team leader kari.virtanen@octomeca.fi Management Janne Koskela, managing director +358 (0)45 6609 600 janne.koskela@octomeca.fi Administration Anne Salosyrjä, Administrative coordinator anne.salosyrja@octomeca.fi ENG Kukolantie 3, FI-21100 Naantali Call center: +358 2 431 44 09 E-mail: sales@octomeca.fi Personal e-mails: firstname.lastname@octomeca.fi Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Youtube © Copyright 2019Octomeca.fi. Search engine optimized webpages and web presence management Planeetta Internet Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Youtube",
    "https://www.octomeca.fi/products/omc-r-series/": "OMC-R Series - Octomeca.fi This website uses cookies to ensure you get the best experience on our website. Read more Accept This website uses cookies to ensure you get the best experience on our website. Read more Octomeca Oy +358 (0)2431 4409 sales@octomeca.fi Youtube Premium Class Load Protection Solutions Menu Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Home Products OMC Series OMC-R Series OMC-R Series OMC-R Series OMC-R reel wrapping machines can wrap various reels of paper, steel, aluminum or composite. The machine can be equipped with rotary arm for axial wrapping or with linearly moving head for radial wrapping. During the wrapping process the reel is rotated on rotary rollers, which can be a part of machine delivery. It is also possible to integrate the radial wrapping head into customers’ existing coiler device or other equipment. Watch videos on youtube ENG Kukolantie 3, FI-21100 Naantali Call center: +358 2 431 44 09 E-mail: sales@octomeca.fi Personal e-mails: firstname.lastname@octomeca.fi Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Youtube © Copyright 2019Octomeca.fi. Search engine optimized webpages and web presence management Planeetta Internet Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle care Lifecycle care Service and Spare Parts Contact request Service request Contact Youtube"
  }
}