{
  "http://mat-service.fi/": {
    "http://mat-service.fi/index.html": "MAT-SERVICE OY MAT-SERVICE The products Mat-Se.ce Oy is a forssa-based industrial transport company. We specialize in hygienic facilities such as food, electronics and paper industry transport systems. Our service comprehensively covers design, equipment deliveries, asny, installation and maintenance supplies. Our aim is to provide customers with strong professional and long-term experience with proven service and installation services for industrial materials and packaging systems. Since 2000, Mat-Se.ce Oy has been a company that designs and manufactures transport systems. Our production facilities are located in Forssan Travel - well and short contacts from Southern Finland's growth centres. Our customers are about 150 kilometres  säus, which ensures a quick service response. We employ three people. We have grown rapidly and Mat-Se.ce has become a major driver of international trade in the domestic industry. Our goal is to continue to grow – we have just expanded our production facilities from 240 square meters to 940 square meters. MAT-SERVICE OY 2016",
    "http://mat-service.fi/yhteystiedot.html": "MAT-SERVICE OY MAT-SERVICE OY MAT-SERVICE OY Jouni Mattila Menostentie 190 31110 Travel Puh/Fax: (i) 435 1416 GSM: 040 760 mail55 Email: Joun.mattila[@]mat-service.fi MAT-SERVICE OY 2016",
    "http://mat-service.fi/tuotteet.html": "MAT-SERVICE OY MAT-SERVICE OY Transportation systems: We have delivered transportation systems to 46 Finnish factories. We are able to provide the most reliable transport systems on the market based on Flexlink products. Our products are: As.ances. When the process works uninter.tedly, there will be no unne.ary and costly inter.tions. The products are also maintenance-free. economically. A well-drained transportation process brings savings to employees. Hygiene. The products meet the hygiene requirements for food production. We manufacture lamell transport systems from 65mm ainadth up to 1200mm. We produce stainless.el. Laminars, labor and other aluminum. We are an importer of Flexlink. MAT-SERVICE OY 2016",
    "http://mat-service.fi/galleria.html": "MAT-SERVICE OY MAT-SERVICE OY 2016"
  },
  "https://www.octomeca.fi/": {
    "https://www.octomeca.fi/contact-request/": "Contact request by Octomeca.fi This website uses cookies to ensure you get the best experience on our website. Read more about This website uses cookies to ensure you get the best experience on our website. Read more Octomeca Oy +358 (0)2431 44  Youtube Premium  Load Protection Solutions Menu Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-R Series OMC-R Series OMC-CW Series Series Lifecycle Care Service and Spare Parts Contact Request Contact Request Contact Requestststions with Announcements If you are a human seeing this field, please leave it empty. ENG Kukolantie 3, FI-21100 Naantali, Center: +358 2 431 44 mail E-mail: Personal e-mails: Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle Care Service and Spare Parts Contact Request Service Contact Youtube CopyrightOctomeca. Search engine optimized webpages and web presence Planet Internet Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle Care Service and Spare Parts Contact Request Contact Youtube",
    "https://www.octomeca.fi/company/octomeca-oy/": "Octomeca Oy - Octomeca.fi This website uses cookies to ensure you get the best experience on our website. Read more about This website uses cookies to ensure you get the best experience on our website. Read more Octomeca Oy +358 (0)2431 44. Youtube Premium. Load Protection Solutions Menu Home Company Octomeca Oy FROMM Group Products OMC-V Series OMC-R Series OMC-R Series OMC-CW Series Lifecycle Care Service and Spare Parts Contact Request Service Contact Company Octomeca Group Home Company Octomeca We are specialized in designing and manufacturing of premium class.etch film wrapping machines. The company is located in Naantali, South-western part of Finland. Today, most of the machines are delivered to customers all around the world. Standard machines witharar construction as well as Tailor-made special innovations in load protection are guiding us forward. Both horizontal and vertical wrapping solutions help us to solve various packaging challenges. With 30 years of experience, Octomeca has delivered over 1,000 wrapping machines and packaging lines all around the world. Since 2017 Octomeca has been a part of international FROMM-Group, specialized in packaging machines and materials. In to wrapping machines, we also provide \"Lifecycle Case\" service, spare parts and modernizations to our machines. We wish to take excellent care of our customers and are committed to guarantee long-lasting, lifetime operation to our solutions. ENG Kukolantie 3, FI-21100 Naantali, Center: +358 2 431 44 mail E-mail: Personal e-mails: Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle Care Service and Spare Parts Contact Request Service Contact Youtube CopyrightOctomeca. Search engine optimized webpages and web presence OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle Care Service and Spare Parts Contact Request",
    "https://www.octomeca.fi/products/omc-h-series/": "OMC-H Series - Octomeca.fi This website uses cookies to ensure you get the best experience on our website. Read more about This website uses cookies to ensure you get the best experience on our website. OMC-H Series OMC-V Series OMC-R Series OMC-R Series OMC-R Series OMC-R Series OMC-CW Series Series Series Series Life Care Care Service and Spare Parts Contact Request Contact Products We provide solutions up to 150pph. OMC-H rotation arm machine is wrapping various loads (with or without pallet) horizontally with.etch. Machines size is defined according to maximum load diagonal measurement. In to predefinedarar sizes, even Tailormade sizes can be made. We do build the largest fully.ic wrapping machines in the market. Power-Pre-Stretch device enables to achieve an economic, sturdy transport packaging. As option, the machines can be equipped with different.. Integrated top sheet (dust or splash proof) - Automatic  meet change applicator (1+3 or 1+9 rolls) - Corner post applicator with various post magazine types -2 Motor Power-Pre-Stretch Carriage (Stepless Pre-stretching Adjustment) -Double arm construction to reach up to 150pph - Poower-pre-Stretch carriage for 750mm wide film Watch videos on youtube OMC-H2100 CPA_RCA4_TSC_V20 ENG Kukolantie 3, FI-21100 Naantali. Center: +358 2 431 44 mail E-mail: Personal e-mails: Home Company Octomeca Products OMCRC-Securities Search oMC-H Series OMC-V Series OMC-R Series OMC-R Series OMC-CW Series Lifecycle Care Service and Spare Parts Contact Request Service Contact Youtube",
    "https://www.octomeca.fi/various-ways-to-protect-your-products-with-stretch-film/": "Various ways to protect your products with Oetch film This website uses cookies to ensure you get the best experience on our website. Read more about This website uses cookies to ensure you get the best experience on our website. Octomeca Oy +358 (0)2431 44  Youtube Premium You Load Protection Solutions Menu Home Company Octomeca Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle Care Service and Spare Parts Contact Request Service Contact Home Various ways to protect your products with protectetch films There are many ways to support and protect product loads during transport and warehousing. Due to our long experience of wrapping machine engineering we can solve even the most demanding customer needs. By combining various innovations andetetch film technology, the products can even be protected from all sides for demanding transport conditions. Individual.etch film bands support the load and are a cost effective and gen. way to improve the final packaging quality. Corner posts protect product/load.s and support stacked pallets loads when placed on top of each other. Well placed top sheet with horizontal wrapping is excellent protection against dust, splash-water and dirt. Logo Curtain System is giving an excellent outlook for your product loads while delivered from the factory. We have many different ways to protect your loads. ENG Kukolantie 3, FI-21100 Naantali, Center: +358 2 431 44 mail E-mail: Personal e-mails: Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle Care Service and Spare Parts Contact Request Service Contact Youtube CopyrightOctomeca. Search engine optimized webpages and web presence Planet Internet Home Company Octomeca FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-R Series OMC-CW Series Lifecycle Care Service and Spare Parts Contact Youtube",
    "https://www.octomeca.fi/company/": "Company of Octomeca.fi This website uses cookies to ensure you get the best experience on our website. Read more about This website uses cookies to ensure you get the best experience on our website. Octomeca Oy +358 (0)2431 44. Youtube Premium Protection Load Protection Request Services Menu Home Company Octomeca Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle Care Service and Spare Parts Contact Request Contact Company Octomeca OMC-V Series OMC-R Series OMC-R Series OMC-R Series OMC-C-C-C-C-C-C-C-C-C-C-C-C-C-C-C-C-C-C-C-C-C-C-C-C-C-C-C-C-C-C-CVIC-C-CVIC-C-C-C-COC-COC-COC-C-COCOCOCVIVIC-C-C-COC-C-C-C-C Search engine optimized webpages and web presence Planet Internet Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle Care Service and Spare Parts Contact Request Contact Youtube",
    "https://www.octomeca.fi/lifecycle-care/total-cost-of-ownership-tco/": "Octomeca.fi This website uses cookies to ensure you get the best experience on our website. Read more about This website uses cookies to ensure you get the best experience on our website. Octomeca Oy +358 (0)2431 44  Youtube Premium  Load Protection Solutions Menu Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Series Lifecycle Care Service and Spare Parts Contact Request Service Contact Lifecycle Care Service and Spare Parts Home Care Care Courseries Top of investments purchase price, the total cost must take account during the whole lifecycle. Most relevant factor in TCO is equipment reliability. Un.nned production stops and low packaging quality are essential elements when evaluating TCO. Profes.al machine installation, commissioning, spare parts, maintenance and technical developments during the life cycle are important factors to ensure excellent TCO. Expected life cycle for Octomeca's equipment is long, even +20 years. This is possible by means of high technical quality of the machines and cost effective lifecycle services provided by Octomeca. Please contact: Lifecycle Services Octomeca offers versatile and professional lifecycle services for all Octomeca equipment's from installation and start to additional machine. and modernizations. It is possible to update the machine with the latest technical innovations at any stage of the life cycle when needed. Proactive maintenance and reliable spare part services are the most important life cycle services that affect the machines life cycle length, TCO and machines e.able usability. Octomeca offers Tailored and flexible preventive maintenance plans based on customers production and machine needs. Top of that Octomeca’s professional service team is ready to serve technical support requests with quick response. Please contact: Preventive maintenances General Services Machine Modernizations Installations and Start Up's Operator Trainings ENG Kukolantie 3, FI-21100 Naantali, Center: +358 2 431 44 mail E-mail: Personal e-mail: Home Company Octomeca Oy FROMMM Group Products OMC-V Series OMC-R Series OMC-CW Series Series Series Lifetime Caretions Search engine optimized webpages and web presence Planet Internet Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle Care Service and Spare Parts Contact Request Contact Youtube",
    "https://www.octomeca.fi/products/omc-v-series/": "OMC-V Series - Octomeca.fi This website uses cookies to ensure you get the best experience on our website. Read more about This website uses cookies to ensure you get the best experience on our website. OMC-V Series OMC-V Series OMC-R Series OMC-R Series OMC-R Series OMC-R Series OMC-CW Series Series Series Lifecycle Service and Spare Parts Contact Request Contact Products OMC-H Series OMC-V Series OMC-R Series OMC-R Series Series OMC-CR Series OMCR Series Series OMC-V Series The products are wrapped .ally, or only making film bands. Bot. beams can be fixed with specific elastic bands. Machine size is defined according to product maximum cross diagonal measurement. We are engineering and manufacturing the biggest Vertical Ring wrappers in the world. We are supplying our solutions to different segments. Integrated top sheet or product end closing equipment - Automatic  change changer 1+3 rolls - Poower-Pre-Stretch carriage -Ring height adjustment kit for bigload size - Load support rollers on top/side -Wrapzone conveyors for loads in case of very big items (ePS blocks), we are able to provide innovative OMC-VO machines. Instead of traditional ring, the rec.gular shaped track of the machine is made according to product dimensions. Watch videos on youtube OMC-V2000TS Layout ENG Kukolantie 3, FI-21100 Naantali. Center: +358 2 431 44 mail E-mail: Personal E-mail: Home Company Octomeca Oy FROMMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle Lifecycle Care Service and Spare Parts Contacts Requestingstacted Services Search engine optimized webpages and web presence oMC-H Series OMC-V Series OMC-R Series OMC-R Series OMC-CW Series Lifecycle Care Service and Spare Parts Request Service Request Contact",
    "https://www.octomeca.fi/fi/": "Octomeca uses cookies to improve the user experience. By using the site, you agree to use cookies. Accept our website to use cookies to improve the user experience. By using the site, you agree to use cookies. Octomeca Oy +358 (0)2431 44teet Youtube Premiumteet Load Protection Solutions Meikko Company Octomeca Oy FROMM Group Products OMC-H range OMC-R range OMC-R range Lifecycle services Service and spare parts The product packed with OMC-V sc.boards will be driven through a vertical wrapping cycle. Inennce with the dimensions of the packaged product, the circular size of the machine is determined. OMC-R can be wrapped with paper, alel, aluminum or composite wheels either a aally or radically. OMC CW curtains are designed to protect chemical-shaped products (such as sawmill and forestry) during transportation. The premium class load protection from the north Octomeca Finland since 1989 has been designed for long-term industrial use. Characteristics are strong teräel frame structure, tested functions and high-quality components. The product packed with OMC-V is driven through a vertical wrapping cycle. Inennce with the dimensions of the packaged product, the circular size of the machine is determined. OMC-R can be wrapped with paper, alel, aluminum or composite wheels either a aally or radically. OMC CW curtains are designed to protect chemical-shaped products (such as sawmill and forestry) during transportation. The premium class load protection from the north Octomeca Finland since 1989 has been designed for long-term industrial use. Characteristics of the model are strongnneel frame structure, tested functions and high-quality teräel structures components. The product packed with OMC-V is driven through a vertical wrapping cycle. Inennce with the dimensions of the packaged product, the circular size of the machine is determined. Octomeca OMC-H range OMC-V range OMC-R range of OMC CW models with Oc.tana tightening machines ensures high quality transport packaging. A cost-effective solution for the Octälogy’s wrapping machine collection can be selected. By combining wrapping technology, tightening film and various additional functions, the customer receives a compact and reliable packaging equipment with the delivery of the “keys in hand”. We solve innovation challenges. The customer does not need to know the characteristics of the different types of machines, but rather the preferred packaging solution. Octomeca will provide technical assistance to achieve the desired packaging solution. Machines are built with decades of experience, using both modern production technology and cutting-edge components. Machines are designed for long-term and demanding use. Our customers are industry-leading companies as well as smaller local companies with a high standard of departure for equipment and services. Qualifications and product protection Kiristekalvo, 100% recyclable packaging material Total Cost of Ownership (TCO), maintenance and spare parts FI Kukolantie 3, 21100 Naantali Stage: +358 2 431 44 44 Email: Personal email addresses: Octomeca Oy FROMM Group Products OMC-H OMC-V collection OMC-R range of OMC-CW Service and spare parts Contact Order Youtube Copyright 2019Octomeca Search engine optimized websites and web presence Octomeca Oy FROMM Group Products OMC-H range OMC-V range of OMC-R range Lifecycle services Service and spare parts Contact with YouTube",
    "https://www.octomeca.fi/service-request/": "Service Request - Octomeca.fi This website uses cookies to ensure you get the best experience on our website. Read more about This website uses cookies to ensure you get the best experience on our website. Read more Octomeca Oy +358 (0)2431 44  Youtube Premium  Load Protection Solutions Menu Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-R Series OMC-R Series OMC-CW Series Lifecycle Care Service and Spare Parts Contact Request Service Request Contact Home Request Service Fields Marked with Name E-mail * Telephone * Company * Customer Nu  (if known) Address * Post Nu  * City * Machine Ty (if known) Description of Needed Service If you are a human seeing this field, please leave it empty. ENG Kukolantie 3, FI-21100 Naantali, Center: +358 2 431 44 mail E-mail: Personal e-mails: Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle Care Service and Spare Parts Contact Request Service Contact Youtube CopyrightOctomeca. Search engine optimized webpages and web presence Planet Internet Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle Care Service and Spare Parts Contact Request Contact Youtube",
    "https://www.octomeca.fi/stretch-film-100-recyclable-packaging-material/": "Chetch film, 100% recyclable packaging material This website uses cookies to ensure you get the best experience on our website. Read more about This website uses cookies to ensure you get the best experience on our website. Read more Octomeca Oy +358 (0)2431 44  Youtube Premium  Load Protection Solutions Menu Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle Care Service and Spare Parts Contact Request Service Request Contact Homeinetch, 100% recycable packaging material Which is one of the most used packaging materials around the world. Due to wide selection of various film qualities and thicknesses, it can be used as protective packaging material to many products or palletized loads. Recently, there has been a lot of discussion about environmental challenges and recycling of the packaging materials. Even so this topic is still a big question, solutions or alternatives in order to improve the material recycling can be found. It’s more or less up to society’s activities to organize recycling and people’s attitudes. Recent development in machines makes it possible to take advantage of the modern.etch films. The pre-stretch device gives a better film force on the load, but it usually means better packaging economy. Thinner film quality can be used or even fewer wrapping ro.s pro pallet.chetch film is made of 100% polyethylene. In order to be able to have the optimal end-result for each customer, it is now possible to combine specific load protection with full recycling. E-mail: Personal e-mails: Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-V Series OMC-R Series OMC-R Series OMC-R Series OMC-CW Series Lifecycle Care Lifecycle care Service and Spare Parts Contact request service request Contact Youtube Copyright 2019Octomeca. Search engine optimized webpages and web presence Planet Internet Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle Care Service and Spare Parts Contact Request Contact Youtube",
    "https://www.octomeca.fi": "Home / Octomeca.fi This website uses cookies to ensure you get the best experience on our website. Read more about This website uses cookies to ensure you get the best experience on our website. Read more Octomeca Oy +358 (0)2431 44. Youtube Premium. Load Protection Solutions Menu Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-R Series OMC-CW Series Series Lifecycle Care Service and Spare Parts Contact Request Service Request Contact OMC-V Series With OMC-V Series Wrapping Machines through the Products The products are wrapped allyally, or only making film bands with bot. beams. Machine size is defined according to product maximum cross diagonal measurement. OMC-R Reel wrapping machines can wrap variety reels of paper, ael, aluminum or composite. The machine can be equipped with rotary arm for axial wrapping or with linearly moving head for rapal wrapping. CW Series OMC-CW (Curtain Wall) machines can be used if the products are rec.gular and special protection. The final package is formed by placing the top sheet between two side film layers. The side films are areetched with ten. rollers and at the end of the process heat-sealed together. Read more OMC-H Series OMC-H Rotary Armament Wraps Variousloads (with or without pallet) Horizontally with.etch Machines size is defined according to maximum load diagonal measurement. In to standard machine sizes, even big models can be made. OMC-V Series with OMC-V series wrapping machines, the product is driven through vertically rotating ring. The products are wrapped allyally, or only making film bands with bot. beams. Machine size is defined according to product maximum cross diagonal measurement. OMC-R reel wrapping machines can wrap different reels of paper, ael, aluminum or composite. The machine can be equipped with rotary arm for axial wrapping or with linearly moving head for rapal wrapping. CW Series OMC-CW (Curtain Wall) machines can be used if the products are rec.gular and special protection. The final package is formed by placing the top sheet between two side film layers. The side films are areetched with ten. rollers and at the end of the process heat-sealed together. Read more OMC-H Series OMC-H Rotary Army Machine Wraps Variousloads (with or without pallet) Horizontally with.etch Machines size is defined according to maximum load diagonal measurement. In to standard machine sizes, even big models can be made. OMC-V Series with OMC-V series wrapping machines, the product is driven through vertically rotating ring. The products are wrapped allyally, or only making film bands with bot. beams. Machine size is defined according to product maximum cross diagonal measurement. OMC-V Series OMC-R Series OMC Series OMC Series OMC Series Load protection for transportation and warehousing with Octomeca wrapping solutions Cost-effective and strong transportation package is achieved by using wetch film wrapping machines. We solve even difficult and demanding wrapping challenges. By combining Byetch film and additional machine functions, customer receives a compact and reliable packaging solution as turn-key delivery. If needed, we can even develop a completely new concept according to customer needs. When asking for a .otation, customer does not need to know all different machine details. The required final package solution is our project starting point. Machines are built using modern technology and high-class components. Technical solutions represent the highest quality and are built for heavy industrial use with minimum service needed. Machines are delivered including installation and start-up. Our customers are the leading companies in different segments worldwide as well as smaller local companies. They all have high quality demands for their production machines and after-sales services. Various ways to protect your products with Toetch film Read moreetetch film, 100% recyclable packaging material read more Total Cost of Ownership (TCO), Service and Spare Parts Read more ENG Kukolantie 3, FI-21100 Naantali. Center: +358 2 431 44 E-mail: Personal e-mails: Home Company Octomeca Oy FROMMM Group Products OMC-H Series OMCRCOCOCOCVI-COCOCOCOCOCOCOCVI-COCOCOCOCOCOCOCLI-COCOCOCOCOCOCOCOCOCOCOCOCLI-COCOCOMEVI-CLILILILILES Search engine optimized webpages and web presence Planet Internet Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle Care Service and Spare Parts Contact Request Contact Youtube",
    "https://www.octomeca.fi/": "Home / Octomeca.fi This website uses cookies to ensure you get the best experience on our website. Read more about This website uses cookies to ensure you get the best experience on our website. Read more Octomeca Oy +358 (0)2431 44. Youtube Premium. Load Protection Solutions Menu Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-R Series OMC-CW Series Series Lifecycle Care Service and Spare Parts Contact Request Service Request Contact OMC-V Series With OMC-V Series Wrapping Machines through the Products The products are wrapped allyally, or only making film bands with bot. beams. Machine size is defined according to product maximum cross diagonal measurement. OMC-R Reel wrapping machines can wrap variety reels of paper, ael, aluminum or composite. The machine can be equipped with rotary arm for axial wrapping or with linearly moving head for rapal wrapping. CW Series OMC-CW (Curtain Wall) machines can be used if the products are rec.gular and special protection. The final package is formed by placing the top sheet between two side film layers. The side films are areetched with ten. rollers and at the end of the process heat-sealed together. Read more OMC-H Series OMC-H Rotary Armament Wraps Variousloads (with or without pallet) Horizontally with.etch Machines size is defined according to maximum load diagonal measurement. In to standard machine sizes, even big models can be made. OMC-V Series with OMC-V series wrapping machines, the product is driven through vertically rotating ring. The products are wrapped allyally, or only making film bands with bot. beams. Machine size is defined according to product maximum cross diagonal measurement. OMC-R reel wrapping machines can wrap different reels of paper, ael, aluminum or composite. The machine can be equipped with rotary arm for axial wrapping or with linearly moving head for rapal wrapping. CW Series OMC-CW (Curtain Wall) machines can be used if the products are rec.gular and special protection. The final package is formed by placing the top sheet between two side film layers. The side films are areetched with ten. rollers and at the end of the process heat-sealed together. Read more OMC-H Series OMC-H Rotary Army Machine Wraps Variousloads (with or without pallet) Horizontally with.etch Machines size is defined according to maximum load diagonal measurement. In to standard machine sizes, even big models can be made. OMC-V Series with OMC-V series wrapping machines, the product is driven through vertically rotating ring. The products are wrapped allyally, or only making film bands with bot. beams. Machine size is defined according to product maximum cross diagonal measurement. OMC-V Series OMC-R Series OMC Series OMC Series OMC Series Load protection for transportation and warehousing with Octomeca wrapping solutions Cost-effective and strong transportation package is achieved by using wetch film wrapping machines. We solve even difficult and demanding wrapping challenges. By combining Byetch film and additional machine functions, customer receives a compact and reliable packaging solution as turn-key delivery. If needed, we can even develop a completely new concept according to customer needs. When asking for a .otation, customer does not need to know all different machine details. The required final package solution is our project starting point. Machines are built using modern technology and high-class components. Technical solutions represent the highest quality and are built for heavy industrial use with minimum service needed. Machines are delivered including installation and start-up. Our customers are the leading companies in different segments worldwide as well as smaller local companies. They all have high quality demands for their production machines and after-sales services. Various ways to protect your products with Toetch film Read moreetetch film, 100% recyclable packaging material read more Total Cost of Ownership (TCO), Service and Spare Parts Read more ENG Kukolantie 3, FI-21100 Naantali. Center: +358 2 431 44 E-mail: Personal e-mails: Home Company Octomeca Oy FROMMM Group Products OMC-H Series OMCRCOCOCOCVI-COCOCOCOCOCOCOCVI-COCOCOCOCOCOCOCLI-COCOCOCOCOCOCOCOCOCOCOCOCLI-COCOCOMEVI-CLILILILILES Search engine optimized webpages and web presence Planet Internet Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle Care Service and Spare Parts Contact Request Contact Youtube",
    "https://www.octomeca.fi/products/omc-cw-series/": "OMC-CW Series - Octomeca.fi This website uses cookies to ensure you get the best experience on our website. Read more about This website uses cookies to ensure you get the best experience on our website. Octomeca Group Products OMC-H Series OMC-V Series OMC-R Series OMC-R Series OMC-R Series OMC-CW Series Series Lifecycle Care Service and Spare Parts Contact Request Contact Products The final package is formed by placing the top sheet between two side film layers. The side films are areetched with ten. rollers and at the end of the process heat-sealed together. The end-result is a strong, splash-water-proof packaging that can also be equipped with printed company logo. Watch videos on youtube OMC-CW1200 with youapper 2 ENG Kukolantie 3, FI-21100 Naantali. Center: +358 2 431 44 mail E-mail: Personal emails: Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-R Series OMC-R Series OMC-CW Series Lifecycle Life Care and Spare Parts Conacts RequestCurvey Conact Search engine optimized webpages and web presence Planet Internet Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle Care Service and Spare Parts Contact Request Contact Youtube",
    "https://www.octomeca.fi/company/fromm-group/": "FROMM Group – Octomeca.fi This website uses cookies to ensure you get the best experience on our website. Read more about This website uses cookies to ensure you get the best experience on our website. Youtube Premium all Load Protection Solutions Menu Home Company Octomeca Group Products OMC-H Series OMC-V Series OMC-R Series OMC-R Series OMC-CW Series Lifecycle Care Service and Spare Parts Contact Request Service Contact Company On a successful track Established in 1947, the Swiss family business generates a turnover in ex. of 180 million Euros and employees a workforce of 900 people worldwide. More than 40 subsidiaries in Europe, North and South America, South Africa, Asia and Australia, along with a multitude of specialized sales partners, provided the world – in your vicinity – professional advice, prompt customer service and maintenance. The company pursues a policy of logical vertical integration while upholding traditional values, which are the reasons for decades of success. In the FROMM Development Center, a long established and experienced team of engineers develop new technologies and products using the very latest 3D CAD systems. Up-to-date test procedures guarantee the high FROMM quality standards. Production Centers for Machines and Equipment Production takes place ro. the clock in the FROMM production centres. Highly qualified teams of specialists, FROMM products satisfying the highest demands of quality on computer-cont.ed machines. All machines are tested before leaving the factory. The iSO 9001 certification. Production centers for polyester plastic exapping and multilayer blown films STARstrap plastic.appings are produced in the FROMM production centres exlusively from recycled polyester bottle material on modern state-of-the-. extru. plant. These bands guarantee the high quality of the equipmentapping carried out with FROMM machines and equipment. All kinds of film types for the Airpad pillow material are produced on blown film extru. machines. Special film types guarantee a high loading capacity of the individual pillow elements. The plants are certified in.nce with ISO 9001 and ISO 14000. PET Recycling Produced in the FROMM Recycling plant from used PET bottles is high grade ground material, agglomerates and regranulates for the production of PET.apping, foodstuff films, textiles and drink bottles. FROMM PET products to satisfy the most rigorous ecological requirements. The plant is certified in.nce with ISO 9001 and ISO 14001. Link to International FROMM Group Pages ENG Kukolantie 3, FI-21100 Naantali. Center: +358 2 431 44 44 E-mail: Personal e-mails: Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle Care Care Service and Spare Parts Contact Requesting Requestststacts Contacted at YouCOC-COCOCOCOCOC-COCOCOCOCOCOCOCOCOC202020202019. Search engine optimized webpages and web presence Planet Internet Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle Care Service and Spare Parts Contact Request Contact Youtube",
    "https://www.octomeca.fi/lifecycle-care/service-and-spare-parts/": "Service and Spare Parts - Octomeca This website uses cookies to ensure you get the best experience on our website. Read more about This website uses cookies to ensure you get the best experience on our website. Read more Octomeca Oy +358 (0)2431 44. Youtube Premium. Load Protection Solutions Menu Home Company Octomeca Oy FROMM Group Effective Products OMC-H Series OMC-R Series OMC-R Series OMC-CW Series Series Lifecycle Care Services and Spare Parts Contact Request Services Contact Lifecycle Services and Spare Works They need to have scheduled service. Octomeca's After Sales Department can offer professional service and spare parts to all our machines. If needed, we can also offer a complete machine installation, start-up and training as turn-key delivery. Even the machines are thoroughly tested before delivery, connections to devices require professional skills. When properly executed, the machine is ready for customer’s use for years to come. Life cycle services Octomeca offers versatile and professional lifecycle services for all Octomeca equipment's from installation and start to additional machine. and modernizations. It is possible to update the machine with the latest technical innovations at any stage of the life cycle when needed. Preventive maintenance and reliable spare part services are the most important lifecycle services that affect the machines life cycle length, TCO and machines e.able usability. Octomeca offers Tailored and flexible preventive maintenance plans based on customers production and machine needs. Top of that Octomeca’s professional team is ready to serve technical support requests with quick response. Machine Preventive Machine Con services modernizations Installations and start up's Operator Trainings Please contact: ENG Kukolantie 3, FI-21100 Naantali. Center: +358 2 431 44 mail E-mail: Personal e-mails: Home Company Octomeca Oy FROMMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle Lifecycle Lifecycle Service and Spare Parts Contact requests Search engine optimized webpages and web presence Planet Internet Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle Care Service and Spare Parts Contact Request Contact Youtube",
    "https://www.octomeca.fi/lifecycle-care/": "Lifecycle care - Octomeca This website uses cookies to ensure you get the best experience on our website. Read more about This website uses cookies to ensure you get the best experience on our website. Setube Premium and Load Protection Request Services Menu Home Company Octomeca Group Products OMC-H Series OMC-V Series OMC-R Series OMC-R Series OMC-CW Series Lifecycle Care Service and Spare Parts Contact Service Request Contact Lifecycle Care Service and Spare Parts Home Care Search engine optimized webpages and web presence Planet Internet Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle Care Service and Spare Parts Contact Request Contact Youtube",
    "https://www.octomeca.fi/cookies": "Cookies by Octomeca.fi This website uses cookies to ensure you get the best experience on our website. Read more about This website uses cookies to ensure you get the best experience on our website. Youtube Premium Lo Load Protection Solutions Menu Home Company Octomeca Group Products OMC-H Series OMC-V Series OMC-R Series OMC-R Series OMC-CW Series Lifecycle Care Service and Spare Parts Contact Request Service Contact Home Cookies What are cookies? A cookie is a small piece of text sent to your browser by a website you visit. Cookies enhance the user experience, for example it helps the website to remember information about your visit, like your preferred language and other settings. Without cookies, using the web would be a much more frustrating experience. Why is this website using cookies? Information of logged in user is kept in a cookie. Without this cookie, user would need to input credentials on every page view when browsing pages where authorization is required. Website will use login after website session is expired. When you confirm notification about cookies, that’s also saved to a cookie. Without this cookie, same notification would be visible in every page load. We are collecting information about browsing users, using Google Analytics. ENG Kukolantie 3, FI-21100 Naantali, Center: +358 2 431 44 mail E-mail: Personal e-mails: Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle Care Service and Spare Parts Contact Service Request Contact Youtube CopyrightOctomeca. Search engine optimized webpages and web presence Planet Internet Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle Care Service and Spare Parts Contact Request Contact Youtube",
    "https://www.octomeca.fi/product-category/omc-series/": "OMC Series - Octomeca.fi This website uses cookies to ensure you get the best experience on our website. Read more about This website uses cookies to ensure you get the best experience on our website. OMC-H Series OMC-V Series OMC-R Series OMC-CW Series OMC-R Series OMC-R Series OMC-R Series OMC-R Series OMC-CW Series Search engine optimized webpages and web presence Planet Internet Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle Care Service and Spare Parts Contact Request Contact Youtube",
    "https://www.octomeca.fi/contact/": "Contact by Octomeca.fi This website uses cookies to ensure you get the best experience on our website. Read more about This website uses cookies to ensure you get the best experience on our website. After Octomeca Oy +358 (0)2431 44 After Youtube Premium Protection Load Protection Request Service and Spare Parts Request Contact Home Contact Kukolantie 3, FI-211 Search engine optimized webpages and web presence Planet Internet Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle Care Service and Spare Parts Contact Request Contact Youtube",
    "https://www.octomeca.fi/products/omc-r-series/": "OMC-R Series - Octomeca.fi This website uses cookies to ensure you get the best experience on our website. Read more about This website uses cookies to ensure you get the best experience on our website. Octomeca Oy +358 (0)2431 44 You Youtube Premium O Load Protection Solutions Menu Home Company Octomeca Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Series Lifecycle Care Service and Spare Parts Contact Request Contact Products OMC-V Series OMCR Series OMCR Series OMCR The machine can be equipped with rotary arm for axial wrapping or with linearly moving head for rapal wrapping. During the wrapping process the reel is rotated on rotary rollers, which can be a part of machine delivery. It is also possible to .ate the radial wrapping head into customers' existing coiler device or other equipment. Watch videos on youtube ENG Kukolantie 3, FI-21100 Naantali. Center: +358 2 431 44 mail E-mail: Personal e-mails: Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-R Series OMC-CW Series Life carecycle lifecycle care service and Spare Parts Contact Youtube CopyrightCOctca 2019. Search engine optimized webpages and web presence Planet Internet Home Company Octomeca Oy FROMM Group Products OMC-H Series OMC-V Series OMC-R Series OMC-CW Series Lifecycle Care Service and Spare Parts Contact Request Contact Youtube"
  }
}